# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Algoritmos
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS: title:nil H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{systeme}

#+latex: \newcommand{\mytitle}{Arquivos Texto - Conversão de Tokens}
#+latex: \mytitleslide

* Conversão de /string/ para ~int~, ~long~ ou ~long long~

Protótipos
#+attr_latex: :options fontsize=\normalsize
#+BEGIN_SRC C
#include<stdlib.h>
int atoi(const char *nptr);
long atol(const char *nptr);
long long atoll(const char *nptr);
#+END_SRC

#+latex: \vfill\pause

Exemplo
#+attr_latex: :options fontsize=\normalsize
#+BEGIN_SRC C :results output :exports both
char str[] = "345612";
int numero;
long numero_longo;
numero = atoi(str);
printf("[%d]\n", numero);
numero_longo = atol(str);
printf("[%ld]\n", numero_longo);
#+END_SRC

#+RESULTS:
: [345612]
: [345612]

* Conversão de /string/ para ~double~

Protótipo
#+attr_latex: :options fontsize=\normalsize
#+BEGIN_SRC C
#include<stdlib.h>
double atof(const char *nptr);
#+END_SRC

#+latex: \vfill\pause

Exemplo
#+attr_latex: :options fontsize=\normalsize
#+BEGIN_SRC C :results output :exports both :includes "<stdlib.h> <stdio.h>"
char str[] = "345612.21098823";
double numero;
numero = atof(str);
printf("[%.15f]\n", numero);
#+END_SRC

#+RESULTS:
: [345612.210988230013754]

* Tokenização com ~strtok~: mais sofisticação

Protótipo
#+attr_latex: :options fontsize=\normalsize
#+BEGIN_SRC C
#include<string.h>
char *strtok(char *str, const char *delim);
#+END_SRC

A função ~strtok()~ quebra a ~str~ em uma sequência de zero ou mais tokens
não vazios. Na primeira chamada para ~strtok()~, a /string/ a ser
processada deve ser especificada em ~str~. Nas chamadas subsequentes que
devem continuar o processamento da mesma string, ~str~ deve ser nulo.

#+latex: \vfill\pause

Exemplo
#+BEGIN_SRC C :includes "<stdio.h> <string.h>" :results output :exports both
char linha[] = "20#Ricardo Garcia Belfast#8.4#5.7#8.8#";
char *p = strtok(linha, "#");
do {
  printf("[%s]\n", p);
} while ((p = strtok(NULL, "#")));
#+END_SRC

#+RESULTS:
: [20]
: [Ricardo Garcia Belfast]
: [8.4]
: [5.7]
: [8.8]
